NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/src/access.c
    return status;
}

static uint32_t packet_alloc_and_tx(access_model_handle_t handle,
                                    const access_message_tx_t * p_tx_message,
                                    const access_message_rx_t * p_rx_message,
                                    uint8_t **pp_access_payload,
                                    uint16_t *p_access_payload_len)
{
    NRF_MESH_ASSERT_DEBUG(p_tx_message != NULL);

    uint32_t status;

    if (!check_tx_params(handle, p_tx_message, p_rx_message, &status))
    {
        return status;
    }

    uint16_t opcode_length = access_utils_opcode_size_get(p_tx_message->opcode);
    uint16_t payload_length = opcode_length + p_tx_message->length;

    uint8_t *p_payload = (uint8_t *) mesh_mem_alloc(payload_length);
    if (NULL == p_payload)
    {
        return NRF_ERROR_NO_MEM;
    }

    opcode_set(p_tx_message->opcode, p_payload);
    memcpy(&p_payload[opcode_length], p_tx_message->p_buffer, p_tx_message->length);

    status = packet_tx(handle, p_tx_message, p_rx_message, p_payload, payload_length);
    if (NRF_SUCCESS != status || NULL == pp_access_payload || NULL == p_access_payload_len)
    {
        mesh_mem_free(p_payload);
        return status;
    }

    *pp_access_payload = p_payload;
    *p_access_payload_len = payload_length;

    return NRF_SUCCESS;
}

static void access_state_clear(void)
{
    memset(&m_model_pool[0], 0, sizeof(m_model_pool));
    memset(&m_element_pool[0], 0, sizeof(m_element_pool));
    memset(&m_subscription_list_pool[0], 0, sizeof(m_subscription_list_pool));
    for (uint16_t i = 0; i < ARRAY_SIZE(m_model_pool); ++i)
    {
        m_model_pool[i].model_info.publish_address_handle = DSM_HANDLE_INVALID;
        m_model_pool[i].model_info.publish_appkey_handle = DSM_HANDLE_INVALID;
        m_model_pool[i].model_info.subscription_pool_index = ACCESS_SUBSCRIPTION_LIST_COUNT;
        m_model_pool[i].model_info.element_index = ACCESS_ELEMENT_INDEX_INVALID;
        m_model_pool[i].publish_divisor = 1;
    }
}

static bool model_subscribes_to_addr(const access_common_t * p_model, dsm_handle_t address_handle)
{
    return (p_model->model_info.subscription_pool_index < ACCESS_SUBSCRIPTION_LIST_COUNT &&
            bitfield_get(m_subscription_list_pool[p_model->model_info.subscription_pool_index].bitfield,
                         address_handle));
}

/**
 * Checks whether a destination address is designated for a specific element.
 *
 * @param[in] p_dst The destination address to check for
 * @param[in,out] p_index Index of the element that should process the message destined for the given address.
 *
 * @returns Whether or not the destination address is designated for a specific element.
 */
static bool is_element_rx_address(const nrf_mesh_address_t * p_dst, uint16_t * p_index)
{
    if (p_dst->type == NRF_MESH_ADDRESS_TYPE_UNICAST)
    {
        dsm_local_unicast_address_t local_addresses;
        dsm_local_unicast_addresses_get(&local_addresses);

        *p_index = p_dst->value - local_addresses.address_start;
        return true;
    }
    else if (p_dst->value == NRF_MESH_ALL_PROXIES_ADDR ||
             p_dst->value == NRF_MESH_ALL_FRIENDS_ADDR ||
             p_dst->value == NRF_MESH_ALL_RELAYS_ADDR ||
             p_dst->value == NRF_MESH_ALL_NODES_ADDR)
    {
        /* According to the Mesh Profile Specification v1.0 section 3.4.2, only models on the
         * primary element of the node shall process the fixed group addresses. */
        *p_index = 0;
        return true;
    }
    return false;
}

/* Checks if the model's subscription list is shared. Note: Model handle must be valid */
static bool model_subscription_list_is_shared(access_model_handle_t handle)
{
    NRF_MESH_ASSERT_DEBUG(model_handle_valid_and_allocated(handle));
    uint16_t sub_pool_index = m_model_pool[handle].model_info.subscription_pool_index;

    for (uint32_t i = 0; i < ACCESS_MODEL_COUNT; ++i)
    {
        if (m_model_pool[i].model_info.subscription_pool_index == sub_pool_index && i != handle)
        {
            return true;
        }
    }

    return false;
}

/* Calculates the value of the fast publish interval. Minimum possible output interval will be 100 ms. */
static void divide_publish_interval(access_publish_resolution_t input_resolution, uint8_t input_steps,
        access_publish_resolution_t * p_output_resolution, uint8_t * p_output_steps, uint16_t divisor)
{
    uint32_t ms100_value = input_steps;

    /* Convert the step value to 100 ms steps depending on the resolution: */
    switch (input_resolution)
    {
        case ACCESS_PUBLISH_RESOLUTION_100MS:
            break;
        case ACCESS_PUBLISH_RESOLUTION_1S:
            ms100_value *= 10;
            break;
        case ACCESS_PUBLISH_RESOLUTION_10S:
            ms100_value *= 100;
            break;
        case ACCESS_PUBLISH_RESOLUTION_10MIN:
            ms100_value *= 6000;
            break;
        default:
            NRF_MESH_ASSERT(false);
    }

    /* Divide the 100 ms value with the fast divisor: */
    ms100_value /= divisor;

    /* Get the divisor corresponding to the new number of 100 ms steps: */
    if (ms100_value < 10)
    {
        *p_output_resolution = ACCESS_PUBLISH_RESOLUTION_100MS;
        if (input_steps == 0)
        {
            *p_output_steps = 0;
        }
        else
        {
            /* Avoid accidentally disabling publishing by dividing by too high a number */
            *p_output_steps = MAX(1, ms100_value);
        }
    }
    else if (ms100_value < 100)
    {
        *p_output_resolution = ACCESS_PUBLISH_RESOLUTION_1S;
        *p_output_steps = ms100_value / 10;
    }
    else if (ms100_value < 6000)
    {
        *p_output_resolution = ACCESS_PUBLISH_RESOLUTION_10S;
        *p_output_steps = ms100_value / 100;
    }
    else
    {
        *p_output_resolution = ACCESS_PUBLISH_RESOLUTION_10MIN;
        *p_output_steps = ms100_value / 6000;
    }

}

static void access_publish_timing_update(access_model_handle_t handle)
{
    access_publish_resolution_t reg_res, fast_res;
    uint8_t reg_steps, fast_steps;

    NRF_MESH_ASSERT(access_model_publish_period_get(handle, &reg_res, &reg_steps) == NRF_SUCCESS);
    divide_publish_interval(reg_res, reg_steps, &fast_res, &fast_steps, m_model_pool[handle].publish_divisor);
    access_publish_period_set(&m_model_pool[handle].publication_state, fast_res, fast_steps);
}

#if PERSISTENT_STORAGE
/** Global flag to keep track of if the flash metadata is up to date.*/
static bool m_metadata_stored;

/** Global flag to keep track of if the flash_manager is not ready for use (being erased or not added) .*/
static bool m_flash_not_ready;

