NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/src/access.c
    access_publish_period_set(&m_model_pool[handle].publication_state, (access_publish_resolution_t)0, 0);
    (void) access_model_reliable_cancel(handle);
    (void) dsm_address_publish_remove(m_model_pool[handle].model_info.publish_address_handle);
    m_model_pool[handle].model_info.publish_address_handle = DSM_HANDLE_INVALID;
    m_model_pool[handle].model_info.publish_appkey_handle = DSM_HANDLE_INVALID;
    m_model_pool[handle].model_info.publication_retransmit.count = 0;
    m_model_pool[handle].model_info.publication_retransmit.interval_steps = 0;
    m_model_pool[handle].model_info.publish_ttl = 0;
    m_model_pool[handle].model_info.publication_period.step_num = 0;
    m_model_pool[handle].model_info.publication_period.step_res = 0;
    m_model_pool[handle].publication_state.period.step_num = 0;
    m_model_pool[handle].publication_state.period.step_res = 0;
    ACCESS_INTERNAL_STATE_OUTDATED_SET(m_model_pool[handle].internal_state);

    return NRF_SUCCESS;
}

uint32_t access_model_publication_by_appkey_stop(dsm_handle_t appkey_handle)
{
    dsm_handle_t local_handle;

    if (DSM_APP_MAX + DSM_DEVICE_MAX <= appkey_handle)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    for (access_model_handle_t i = 0; i < ACCESS_MODEL_COUNT; i++)
    {
        if (NRF_SUCCESS == access_model_publish_application_get(i, &local_handle))
        {
            if (local_handle == appkey_handle)
            {
                (void) access_model_publication_stop(i);
            }
        }
    }

    return NRF_SUCCESS;
}

const void * access_flash_area_get(void)
{
#ifdef ACCESS_FLASH_AREA_LOCATION
    return (const flash_manager_page_t *) ACCESS_FLASH_AREA_LOCATION;
#else
    return (const flash_manager_page_t *) (((const uint8_t *) dsm_flash_area_get()) - (ACCESS_FLASH_PAGE_COUNT * PAGE_SIZE));
#endif
}
